# Bases de Datos I
## Laboratorio 8: DDL y un tin de DML

### Configuración ⚙️

In [ ]:
import sqlalchemy

Vamos a estar usando el módulo de Python `sqlalchemy`, el cual nos permitirá ejecutar código SQL dentro de una celda de Python, gracias a la función `create_engine`. Esta recibe un parámetro: el _string_ de conexión del servicio de MySQL.

In [ ]:
sqlalchemy.create_engine("mysql://root:root@localhost:3306")

En el _string_ de conexión hay 3 fragmentos relevantes:

$mysql://\underbrace{root}_{usuario}:\underbrace{root}_{contraseña}@localhost:\underbrace{3306}_{puerto}$

Si tu entorno de desarrollo provino de las imágenes de Docker o la de Linux que estuvimos compartiendo, pues debe funcionar tal y como está. En cualquier otro caso, siéntete libre de modificar acordemente el _string_ de conexión en los pocos lugares en los que aparece en este archivo :)

Necesitamos dos pasos más de configuración:
1. cargar la extensión de SQL:

In [ ]:
%load_ext sql

2. conectarnos al servidor, usando el mismo _string_ de conexión:

In [ ]:
%sql mysql://root:root@localhost:3306

Y... ¡ya estamos listos para ejecutar SQL! 🥳🥳🥳

Vamos a verlo en un ejercicio...

### Ejercicios 🏋️‍♂️
#### _Data Definition Language_
Dadas las relaciones que se muestran a continuación del diseño de una base de datos, solucione los incisos que le siguen:

**Cliente**(<u>NoC</u>, NombreC, Provincia)  
**Producto**(<u>NoP</u>, NombreP, Precio)  
**Orden**(<u>NoC</u>, <u>NoP</u>, <u>Fecha</u>, Precio, Cantidad)  
NoC **FK** Cliente. No admite nulos  
NoP **FK** Producto. No admite nulos  

a) Escriba las sentencias SQL para la creación de la base de datos `venta` que corresponda con las relaciones anteriores.

> **Voz en off con tono grave:** para ejecutar SQL debemos comenzar el _statement_ con `%sql` en caso de que sólo ocupe una línea, y con `%%sql` si se trata de un bloque. 
> 
> Veamos cómo crear la base de datos:

In [ ]:
%sql CREATE DATABASE IF NOT EXISTS ventas;

In [ ]:
# y si se crea, se...
%sql

> **Voz en off con tono grave:** sí, la celda anterior es para que la completes 😒, al igual que todas las que siguen 🙂.
>
> ¡A crear tablas!

b) Utilizando el lenguaje SQL realice las siguientes modificaciones a la definición de 
la base de datos `venta`.

1. Agregar el atributo Categoría, de tipo VARCHAR y no más de 60 caracteres, a la tabla Producto.

2. Agregar el atributo Dirección, de tipo CHAR y no más de 80 caracteres, a la tabla Cliente.

3. Modificar la cantidad máxima de caracteres a 20 del atributo Categoría de la tabla Producto.

4. Modificar la cantidad máxima de caracteres a 100 del atributo Dirección de la tabla Producto.

5. Eliminar el atributo Categoría de la tabla Producto.

6. Eliminar el atributo Precio de la tabla Orden.

7. Insertar un cliente cuyo identificador es 1, su Nombre es Edgar Frank Codd y la Provincia, Isla de Portland.

8. Cambiar la provincia a Isla Williams del cliente cuyo nombre es Edgar Frank Codd.

9) Eliminar los clientes cuyo nombre sea Edgar Frank Codd.

#### _Data Manipulation Language_

> **Voz en off con tono grave:** ejecutemos los siguientes comandos para insertar vaaaaarios clientes.

In [ ]:
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('International', 'Las Tunas', 'Calle 8355');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Electronic Bike Repair & Supplies', 'Las Tunas', 'Calle 6022');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Premier Sport, Inc.', 'Ciudad de la Habana', 'Calle 6029');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Comfort Road Bicycles', 'Granma', 'Calle 4979');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Metro Sport Equipment', 'Santiago de Cuba', 'Calle 3463');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Green Lake Bike Company', 'Matanzas', 'Calle 5205');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Mountain Works', 'Camagüey', 'Calle 5225');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('Continental Pro Cycles', 'Santiago de Cuba', 'Calle 1273');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ('A. Datum Corporation', 'Granma', 'Calle 9957');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Trey Research', 'Camagüey', 'Calle 3831');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Andersons Custom Bikes', 'Holguín', 'Calle 8631');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Compete, Inc.', 'Santiago de Cuba', 'Calle 1293');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Beaumont Bikes', 'Las Tunas', 'Calle 5736');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Light Speed', 'Santiago de Cuba', 'Calle 7187');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'SUPERSALES INC.', 'Ciego de Ávila', 'Calle 1729');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Image Makers Bike Center', 'Ciudad de la Habana', 'Calle 5079');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Compete Enterprises, Inc', 'Matanzas', 'Calle 9895');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'G & K Bicycle Corp.', 'Camagüey', 'Calle 7865');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Cycling Master', 'Pinar del Río', 'Calle 4428');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Jeffs Sporting Goods', 'Cienfuegos', 'Calle 9616');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Business Equipment Center', 'Sancti Spíritus', 'Calle 7443');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Victory Bikes', 'La Habana', 'Calle 3460');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Norstan Bike Hut', 'Granma', 'Calle 8152');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'First Rate Bicycles', 'Cienfuegos', 'Calle 5114');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Ready Rentals', 'La Habana', 'Calle 2991');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'First National Sport Co.', 'Villa Clara', 'Calle 7467');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Capital Road Cycles', 'Camagüey', 'Calle 5391');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Wide World Importers', 'Ciudad de la Habana', 'Calle 8902');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Integrated Sport Products', 'Holguín', 'Calle 7617');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Consumer Cycles', 'Granma', 'Calle 7117');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Federal Sport', 'Camagüey', 'Calle 2965');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Advanced Bicycles', 'Granma', 'Calle 9067');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Signature Cycles', 'La Habana', 'Calle 8546');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Indiana Bicycle Center', 'Ciudad de la Habana', 'Calle 6796');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Mitchell Sports', 'Holguín', 'Calle 2972');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Recreation Place', 'Santiago de Cuba', 'Calle 5331');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Inner City Bikes', 'Camagüey', 'Calle 7476');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Allenson Cycles', 'Holguín', 'Calle 1908');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Hills Bicycle Service', 'Las Tunas', 'Calle 7465');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'West Junction Cycles', 'La Habana', 'Calle 9145');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Speed Corporation', 'Ciudad de la Habana', 'Calle 5290');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Legend Cycles', 'Ciego de Ávila', 'Calle 3929');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Inline Accessories', 'Camagüey', 'Calle 5215');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Competition Bike Training Systems', 'Holguín', 'Calle 8282');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Chicago City Saddles', 'Holguín', 'Calle 7879');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Burnett Road Warriors', 'Santiago de Cuba', 'Calle 3654');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Bike Satellite Inc.', 'Sancti Spíritus', 'Calle 6969');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Gardner Touring Cycles', 'Cienfuegos', 'Calle 3580');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Magic Cycles', 'Holguín', 'Calle 3002');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Vision Cycles, Inc.', 'Ciudad de la Habana', 'Calle 1616');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Bergeron Off-Roads', 'Camagüey', 'Calle 7236');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Hybrid Bicycle Center', 'Camagüey', 'Calle 9347');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Jackson Authority', 'Ciudad de la Habana', 'Calle 9357');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Pro Sport Industries', 'Pinar del Río', 'Calle 9100');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Sport Fan Co.', 'Camagüey', 'Calle 1845');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'International Bicycles', 'La Habana', 'Calle 1962');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Wood Fitness', 'Ciego de Ávila', 'Calle 9576');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Midwest Sport, Inc.', 'Sancti Spíritus', 'Calle 2332');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Electronic Bike Co.', 'Camagüey', 'Calle 6128');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'International Sport Assoc.', 'Ciudad de la Habana', 'Calle 6563');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Lindell', 'Pinar del Río', 'Calle 4248');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Training Systems', 'Granma', 'Calle 1560');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Merit Bikes', 'Matanzas', 'Calle 7344');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Circuit Cycles', 'Santiago de Cuba', 'Calle 9898');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'International Trek Center', 'Villa Clara', 'Calle 5704');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Lakewood Bicycle', 'Matanzas', 'Calle 5558');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Knopfler Cycles', 'Sancti Spíritus', 'Calle 1513');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Leaf River Terrain', 'Matanzas', 'Calle 5464');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'National Bike Association', 'Granma', 'Calle 6517');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Sport Playground', 'La Habana', 'Calle 7680');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Vista Road Bikes', 'Villa Clara', 'Calle 9399');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Varsity Sport Co.', 'La Habana', 'Calle 7296');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Crowley Sport', 'Camagüey', 'Calle 8474');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Australia Bike Retailer', 'Camagüey', 'Calle 6127');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Northern Bike Travel', 'Ciudad de la Habana', 'Calle 2660');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Cruger Bike Company', 'Ciego de Ávila', 'Calle 3256');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Custom Frames, Inc.', 'Santiago de Cuba', 'Calle 6117');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Aurora Bike Center', 'Pinar del Río', 'Calle 3372');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'GMA Ski & Bike', 'Holguín', 'Calle 6112');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Bicycle Specialists', 'Camagüey', 'Calle 5646');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Bloomington Multisport', 'Santiago de Cuba', 'Calle 1699');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Illinois Trek & Clothing', 'Sancti Spíritus', 'Calle 2401');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Litware, Inc.', 'Holguín', 'Calle 6782');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Proseware, Inc.', 'Ciego de Ávila', 'Calle 5975');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'American Bicycles and Wheels', 'Camagüey', 'Calle 9949');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Carlson Specialties', 'Matanzas', 'Calle 1580');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Expert Bike Co', 'Sancti Spíritus', 'Calle 5347');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Greenwood Athletic Company', 'Ciudad de la Habana', 'Calle 1645');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Sports House', 'Ciudad de la Habana', 'Calle 2357');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Reliance Fitness, Inc.', 'Villa Clara', 'Calle 5059');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'WestAmerica Bicycle Co.', 'Pinar del Río', 'Calle 4499');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'American Bikes', 'Holguín', 'Calle 2823');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Chicago Rent-All', 'Granma', 'Calle 1266');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Superior Bicycles', 'Sancti Spíritus', 'Calle 9665');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Team Athletic Co.', 'Santiago de Cuba', 'Calle 1151');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Hill Bicycle Center', 'Camagüey', 'Calle 3504');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Northwind Traders', 'Santiago de Cuba', 'Calle 6289');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Trikes, Inc.', 'Holguín', 'Calle 3917');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Marsh', 'Villa Clara', 'Calle 9773');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Holiday Skate & Cycle', 'Granma', 'Calle 9755');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Touring Equipment Center', 'Matanzas', 'Calle 2190');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Fitness Association', 'Granma', 'Calle 2603');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Morgan Bike Accessories', 'Granma', 'Calle 5901');
%sql INSERT INTO Cliente (NombreC,Provincia,Dirección) VALUES ( 'Professional Athletic Consultants', 'Holguín', 'Calle 5625');

> **Voz en off con tono grave:** ahora para los productos.

In [ ]:
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (1, 'Adjustable Race', 248);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (2, 'Bearing Ball', 110);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (3, 'BB Ball Bearing', 467);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (4, 'Headset Ball Bearings', 771);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (5, 'Blade', 657);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (6, 'LL Crankarm', 432);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (7, 'ML Crankarm', 354);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (8, 'HL Crankarm', 943);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (9, 'Chainring Bolts', 101);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (10, 'Chainring Nut', 642);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (11, 'Chainring', 28);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (12, 'Crown Race', 248);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (13, 'Chain Stays', 320);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (14, 'Decal 1', 989);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (15, 'Decal 2', 682);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (16, 'Down Tube', 654);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (17, 'Mountain End Caps', 282);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (18, 'Road End Caps', 615);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (19, 'Touring End Caps', 704);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (20, 'Fork End', 701);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (21, 'Freewheel', 949);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (22, 'Flat Washer 1', 93);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (23, 'Flat Washer 6', 160);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (24, 'Flat Washer 2', 381);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (25, 'Flat Washer 9', 797);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (26, 'Flat Washer 4', 169);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (27, 'Flat Washer 3', 793);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (28, 'Flat Washer 8', 307);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (29, 'Flat Washer 5', 823);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (30, 'Flat Washer 7', 886);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (31, 'Fork Crown', 556);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (32, 'Front Derailleur Cage', 716);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (33, 'Front Derailleur Linkage', 699);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (34, 'Guide Pulley', 13);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (35, 'LL Grip Tape', 991);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (36, 'ML Grip Tape', 806);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (37, 'HL Grip Tape', 858);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (38, 'Thin-Jam Hex Nut 9', 62);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (39, 'Thin-Jam Hex Nut 10', 514);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (40, 'Thin-Jam Hex Nut 1', 525);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (41, 'Thin-Jam Hex Nut 2', 272);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (42, 'Thin-Jam Hex Nut 15', 993);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (43, 'Thin-Jam Hex Nut 16', 691);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (44, 'Thin-Jam Hex Nut 5', 386);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (45, 'Thin-Jam Hex Nut 6', 434);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (46, 'Thin-Jam Hex Nut 3', 675);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (47, 'Thin-Jam Hex Nut 4', 677);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (48, 'Thin-Jam Hex Nut 13', 472);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (49, 'Thin-Jam Hex Nut 14', 244);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (50, 'Thin-Jam Hex Nut 7', 353);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (51, 'Thin-Jam Hex Nut 8', 526);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (52, 'Thin-Jam Hex Nut 12', 169);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (53, 'Thin-Jam Hex Nut 11', 346);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (54, 'Hex Nut 5', 691);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (55, 'Hex Nut 6', 395);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (56, 'Hex Nut 16', 155);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (57, 'Hex Nut 17', 949);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (58, 'Hex Nut 7', 85);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (59, 'Hex Nut 8', 973);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (60, 'Hex Nut 9', 488);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (61, 'Hex Nut 22', 638);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (62, 'Hex Nut 23', 46);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (63, 'Hex Nut 12', 120);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (64, 'Hex Nut 13', 214);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (65, 'Hex Nut 1', 86);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (66, 'Hex Nut 10', 311);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (67, 'Hex Nut 11', 548);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (68, 'Hex Nut 2', 306);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (69, 'Hex Nut 20', 997);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (70, 'Hex Nut 21', 875);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (71, 'Hex Nut 3', 796);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (72, 'Hex Nut 14', 220);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (73, 'Hex Nut 15', 100);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (74, 'Hex Nut 4', 178);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (75, 'Hex Nut 18', 428);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (76, 'Hex Nut 19', 955);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (77, 'Handlebar Tube', 402);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (78, 'Head Tube', 774);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (79, 'LL Hub', 947);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (80, 'HL Hub', 122);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (81, 'Keyed Washer', 492);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (82, 'External Lock Washer 3', 320);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (83, 'External Lock Washer 4', 62);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (84, 'External Lock Washer 9', 469);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (85, 'External Lock Washer 5', 360);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (86, 'External Lock Washer 7', 386);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (87, 'External Lock Washer 6', 370);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (88, 'External Lock Washer 1', 7);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (89, 'External Lock Washer 8', 618);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (90, 'External Lock Washer 2', 836);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (91, 'Internal Lock Washer 3', 856);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (92, 'Internal Lock Washer 4', 773);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (93, 'Internal Lock Washer 9', 88);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (94, 'Internal Lock Washer 5', 26);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (95, 'Internal Lock Washer 7', 886);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (96, 'Internal Lock Washer 6', 225);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (97, 'Internal Lock Washer 10', 872);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (98, 'Internal Lock Washer 1', 476);
%sql INSERT INTO Producto (NoP, NombreP,Precio) VALUES (99, 'Internal Lock Washer 8', 300);

> **Voz en off con tono grave:** finalmente insertemos algunas órdenes de compra, que alguien tiene que comprar en esta tienda :)

In [ ]:
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (83, 1, '2011-05-17 00:00:00', '4');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (32, 38, '2011-05-17 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (32, 39, '2011-05-17 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (38, 203, '2011-05-17 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (85, 4, '2011-05-17 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (92, 185, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (11, 186, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (84, 6, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (84, 7, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (84, 8, '2011-05-31 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 82, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 83, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 84, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 85, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (78, 86, '2011-05-31 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 101, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 102, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 103, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 104, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (74, 105, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (13, 9, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (13, 10, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (13, 11, '2012-01-14 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (51, 117, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (51, 118, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (51, 119, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (51, 120, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (80, 446, '2012-01-14 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (47, 9, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (47, 10, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (47, 11, '2012-01-14 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (81, 177, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (46, 176, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (21, 12, '2012-01-14 00:00:00', '3');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (27, 196, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (27, 197, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 171, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 172, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 173, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 174, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (86, 175, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 413, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 414, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 415, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 416, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (45, 417, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (93, 179, '2012-01-15 00:00:00', '60');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (64, 32, '2012-01-15 00:00:00', '550');
%sql INSERT INTO Orden (NoC,NoP,Fecha,Cantidad) VALUES (64, 33, '2012-01-15 00:00:00', '550');

c) Implemente las siguientes consultas:

10) Obtener el nombre y la dirección de todos los clientes.

11) Obtener los clientes cuyos nombres comienzan con "International".

12) Obtener el nombre y el precio de los productos que se han vendido.

13) Obtener el nombre de los productos cuyo precio es menor que 100 pesos.

14) Obtener el nombre, la dirección y la provincia de los clientes que viven en la provincia "La Habana" o "Pinar del Río".